---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LevelDataFloorPerimeter
source: html/393117cf-56c7-0a87-1cdc-26db1bfa6a86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LevelDataFloorPerimeter Property

"Floor Perimeter"

## Syntax (C#)
```csharp
public static ForgeTypeId LevelDataFloorPerimeter { get; }
```